{
  "INFO_PROFILE_TITLE": "Desarrollador de software",
  "INFO_RESUME_SUMMARY": "Ingeniero en sistemas con 7 años de experiencia en desarrollo full-stack, especializado en la creación de soluciones tecnológicas eficientes y seguras para empresas. Mi enfoque está en la automatización de procesos y la implementación de sistemas de facturación electrónica. Con un fuerte dominio de tecnologías como .NET Core, React, PHP y SQL Server, he liderado proyectos de gran envergadura, desarrollando sistemas escalables y gestionando datos en la nube. Además, poseo experiencia en la creación de API RESTful utilizando patrones de diseño como CQRS y MVC.",
  "EDUCATION_TITLE": "Graduado en Ingeniería en Sistemas Computacionales, Instituto Tecnológico Superior De Arandas",
  "EDUCATION_DESCRIPTION": "Con un título en Ingeniería en Sistemas Computacionales del Instituto Tecnológico Superior De Arandas, cultivé las habilidades y conocimientos que forman la base de mi experiencia en desarrollo de software y programación.",
  "WORK_EXPERIENCE_TITLE_1": "Desarrollador full stack - Flexor Infraestructura, Guadalajara, México",
  "WORK_EXPERIENCE_DATE_1": "July 2016 – January 2019",
  "WORK_EXPERIENCE_DESCRIPTION_1": "Participé en el desarrollo de portales de autofactura para gasolineras, mejorando la experiencia del usuario y facilitando la gestión de transacciones. Además, creé páginas web personalizadas basadas en las necesidades del cliente. Colaboré en la creación de un ERP en PHP utilizando SQL para la gestión de bases de datos, HTML, JQuery y Bootstrap para el desarrollo front-end, lo que permitió una integración fluida y una interfaz intuitiva. Finalmente, implementé facturación electrónica utilizando servicios SOAP en C#.",

  "WORK_EXPERIENCE_TITLE_2": "Desarrollador full stack - Massive Home, Guadalajara, México",
  "WORK_EXPERIENCE_DATE_2": " Enero 2019  – Actualidad",
  "WORK_EXPERIENCE_DESCRIPTION_2": "Fui responsable del mantenimiento y actualización de aplicaciones web, garantizando un rendimiento óptimo y la incorporación de nuevas funcionalidades. Identifiqué y resolví errores en el código. Colaboré con StartNet, una empresa china, en la integración de un servicio de facturación electrónica en su sistema. Diseñé y desarrollé aplicaciones utilizando tecnologías como .NET Core, PHP, ReactJS, SQL Server, MySQL, Azure, entre otras, asegurando la integración de soluciones eficientes. Trabajé con equipos para la recopilación de soluciones innovadoras y eficientes. Diseñé e implementé un sistema de facturación electrónica cumpliendo con la versión 4.0 de las especificaciones del SAT, asegurando la validez fiscal de las transacciones. Además, supervisé a un grupo de 4 programadores junior, brindando orientación técnica y promoviendo su desarrollo profesional."
}
